03 Testrapport/02 OA release/01 I&T Artefacten/02 Technisch/01 I&T testtool/02 Tool/Mutatie verwerking/M01/3.BRP/Bevraging/M01_SOAP-GDP01-P1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:brp="http://www.bzk.nl/brp/brp0200">
   <soapenv:Header/>
   <soapenv:Body>
      <brp:lvg_bvgGeefDetailsPersoon>
         <brp:stuurgegevens brp:communicatieID="01">
            <brp:zendendePartij>036301</brp:zendendePartij>
            <brp:zendendeSysteem>oBRP</brp:zendendeSysteem>
            <brp:referentienummer>88409eeb-1aa5-43fc-8614-43055123a165</brp:referentienummer>
            <brp:tijdstipVerzending>2016-10-04T08:15:23.687+02:00</brp:tijdstipVerzending>
         </brp:stuurgegevens>
         <brp:parameters brp:communicatieID="02">
            <brp:rolNaam>Bijhoudingsorgaan College</brp:rolNaam>
            <brp:leveringsautorisatieIdentificatie>1</brp:leveringsautorisatieIdentificatie>
            <brp:dienstIdentificatie>5</brp:dienstIdentificatie>
         </brp:parameters>
         <brp:identificatiecriteria brp:communicatieID="03">
            <brp:burgerservicenummer>983393394</brp:burgerservicenummer>
         </brp:identificatiecriteria>
      </brp:lvg_bvgGeefDetailsPersoon>
   </soapenv:Body>
</soapenv:Envelope>